README.org
#+TITLE: Emacs Configurations
#+AUTHOR: Madhavan Raja

* Introduction
An Emacs configuration for note taking, documenting and development. Clone using:

#+BEGIN_SRC bash :tangle no
  git clone https://github.com/madhavan-raja/emacs-config.git ~/.emacs.d
#+END_SRC

Open =README.org= in Emacs and run:

#+BEGIN_SRC emacs-lisp :tangle no
  (org-babel-tangle)
#+END_SRC

Lastly, restart Emacs.

* Table of Contents :toc:
- [[#introduction][Introduction]]
- [[#packages][Packages]]
- [[#window][Window]]
- [[#behaviour][Behaviour]]
  - [[#basic-settings][Basic Settings]]
  - [[#backup-files][Backup Files]]
  - [[#notifications][Notifications]]
  - [[#esc-cancels-the-current-command][Esc cancels the current command]]
  - [[#custom-file][Custom File]]
- [[#theme][Theme]]
- [[#basic-visual-adjustments][Basic Visual Adjustments]]
  - [[#disable-the-scroll-bar-menu-bar-tool-bar-tooltips-and-the-start-screens][Disable the scroll bar, menu bar, tool bar, tooltips, and the start screens]]
  - [[#prettify-things][Prettify Things]]
  - [[#line-numbers][Line Numbers]]
  - [[#miscellaneous-minor-modes][Miscellaneous Minor Modes]]
- [[#fonts][Fonts]]
- [[#indentations][Indentations]]
- [[#all-the-icons][All The Icons]]
  - [[#prerequisites][Prerequisites]]
  - [[#package-installation][Package Installation]]
- [[#evil-mode][Evil Mode]]
  - [[#base][Base]]
  - [[#collection][Collection]]
  - [[#evil-org][Evil Org]]
  - [[#leader][Leader]]
  - [[#additional-keybindings][Additional Keybindings]]
  - [[#miscellaneous-settings][Miscellaneous Settings]]
- [[#additional-packages][Additional Packages]]
  - [[#which-key][Which Key]]
  - [[#m-x-completion][M-x Completion]]
  - [[#neotree][Neotree]]
  - [[#magit][Magit]]
  - [[#parentheses][Parentheses]]
  - [[#modeline][Modeline]]
  - [[#undo-tree][Undo Tree]]
  - [[#formatter][Formatter]]
  - [[#lsp][LSP]]
  - [[#company][Company]]
  - [[#flycheck][Flycheck]]
  - [[#projectile][Projectile]]
- [[#org-mode][Org Mode]]
  - [[#org-download][Org Download]]
  - [[#org-indent][Org Indent]]
  - [[#pretty-entities][Pretty Entities]]
  - [[#org-bullets][Org Bullets]]
  - [[#org-ellipses][Org Ellipses]]
  - [[#org-toc][Org TOC]]
  - [[#svg-tag-mode][SVG Tag Mode]]
  - [[#keywords][Keywords]]
- [[#functions][Functions]]
  - [[#compilation][Compilation]]

* Packages
We set up melpa, use-package, and straight.el for installing package later on. Melpa has a lot more packages than the default elpa. Use-package is pretty /useful/ (pun intended) since packages can be automatically installed and lazy-loaded. Straight.el is for downloading packages from git repos. We also install the package =auto-package-update= to update installed packages.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (require 'package)

  (setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                           ("melpa" . "http://melpa.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (require 'use-package)

  (setq use-package-always-ensure t)
  (setq package-enable-at-startup nil)

  (use-package auto-package-update
     :ensure t
     :config
     (setq auto-package-update-delete-old-versions t
           auto-package-update-interval 4)
     (auto-package-update-maybe))
#+END_SRC

* Window
Set window title, start the application maximized and disable the startup screen.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq frame-title-format "%b - Emacs")
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
  (setq ring-bell-function 'ignore)
#+END_SRC

* Behaviour
** Basic Settings
#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq-default
    delete-by-moving-to-trash t ;; Move to trash instead of deleting
    require-final-newline t ;; Auto create a newline at end of file
    custom-safe-themes t ;; Don't ask if theme is safe
    warning-minimum-level :emergency ;; Emacs, honestly, I want you to shut up
    disabled-command-function nil ;; Yes I want to use that command
    vc-follow-symlinks) ;; Follow those damn symlinks!

  (defalias 'yes-or-no-p 'y-or-n-p) ;; Y or N instead of yes or no

  (setq scroll-margin 1
    scroll-step 1
    scroll-conservatively 10000
    smooth-scroll-margin 1)
#+END_SRC

** Backup Files
Disable the generation of backup files.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq make-backup-files nil)
#+END_SRC

** Notifications
Disable the notifications.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq ring-bell-function 'ignore)
#+END_SRC

** Esc cancels the current command
Map the escape key to cancel the current command. Useful with =evil-mode=.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+END_SRC

** Custom File
Set the location of the custom files to =.custom= directory.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq custom-file (expand-file-name ".custom" user-emacs-directory))
#+END_SRC

* Theme
#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package doom-themes
    :config
    (load-theme 'doom-dark+ t)
    (doom-themes-neotree-config))
#+END_SRC

* Basic Visual Adjustments
** Disable the scroll bar, menu bar, tool bar, tooltips, and the start screens
#+BEGIN_SRC emacs-lisp :tangle init.el
  (scroll-bar-mode -1)
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (setq inhibit-splash-screen nil
    inhibit-startup-echo-area-message t
    inhibit-startup-message t)
#+END_SRC

** Prettify Things
This replaces some text with icons. Also ligatures.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defun org/prettify-set ()
    (interactive)
    (setq prettify-symbols-alist
        '(("#+begin_example" . "")
          ("#+BEGIN_EXAMPLE" . "")
          ("#+end_example" . "")
          ("#+END_EXAMPLE" . "")
          ("#+results:" . "")
          ("#+RESULTS:" . "")
          ("#+begin_quote" . "❝")
          ("#+BEGIN_QUOTE" . "❝")
          ("#+end_quote" . "❞")
          ("#+END_QUOTE" . "❞")
          ("[ ]" . "☐")
          ("[-]" . "◯")
          ("[X]" . "☑"))))
  (add-hook 'org-mode-hook 'org/prettify-set)

  (defun prog/prettify-set ()
    (interactive)
    (setq prettify-symbols-alist
        '(("lambda" . "λ")
          ("->" . "→")
          ("<-" . "←")
          ("<=" . "≤")
          (">=" . "≥")
          ("!=" . "≠")
          ("~=" . "≃")
          ("=~" . "≃"))))
  (add-hook 'prog-mode-hook 'prog/prettify-set)

  (global-prettify-symbols-mode)
#+END_SRC

** Line Numbers
Display line numbers when programming.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-display-line-numbers-mode)
  (setq display-line-numbers-type 'relative)
#+END_SRC

And sometimes line numbers can be distracting, so we disable them for certain modes.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (dolist (mode '(org-mode-hook
    term-mode-hook
    eshell-mode-hook
    neotree-mode-hook
    elfeed-show-mode-hook
    circe-channel-mode-hook
    circe-chat-mode-hook
    doc-view-mode-hook
    xwidget-webkit-mode-hook
    woman-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+END_SRC

** Miscellaneous Minor Modes
These are some useful minor modes that I tend to use.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (save-place-mode) ;; Save location
  (global-visual-line-mode) ;; Wrap lines
  (global-auto-revert-mode) ;; Revert buffers
#+END_SRC
* Fonts
Set font and fringe background color:

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq text-scale-mode-step 1.1)

  (set-face-attribute 'default nil :family "Iosevka" :weight 'regular :height 120)
  (set-face-attribute 'fixed-pitch nil :font "Iosevka" :weight 'regular :height 1.0)
  (set-face-attribute 'variable-pitch nil :font "Times New Roman" :height 120)
#+END_SRC

* Indentations
Configuring indentation.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq-default indent-tabs-mode nil
      tab-width 2)
  (setq indent-line-function 'insert-tab)
#+END_SRC

* All The Icons
Fonts used by =doom-modeline=.

** Prerequisites
Install the fonts first by running:

#+BEGIN_SRC emacs-lisp :tangle no
  (all-the-icons-install-fonts)
#+END_SRC

** Package Installation
Install the package using:

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package all-the-icons)
#+END_SRC

* Evil Mode
Here we install and configure evil, since I /cannot/ use the default Emacs keys. Evil is the only way I've managed to move to Emacs. The Vim key bindings are a /lot/ better than the Emacs keybindings. Evil-collection is for miscellaneous minor modes, evil-org for org mode, and evil-leader adds a leader key.

** Base
This is the main evil package, that allows you to use vim keybindings.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    :config
    (evil-mode 1))
#+END_SRC

** Collection
This package adds Vim keybindings for miscellaneous minor modes, such as dired and mu4e.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+END_SRC

** Evil Org
For some reason evil-collection doesn't include org bindings, so we install another package.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package evil-org
    :diminish evil-org-mode
    :after org
    :config
    (add-hook 'org-mode-hook 'evil-org-mode)
    (add-hook 'evil-org-mode-hook
              (lambda () (evil-org-set-key-theme))))

  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys)
#+END_SRC

