README.org
** Modeline
The default mode line is ugly, so this package replaces it with one that looks like the Doom mode line.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq display-time-default-load-average nil)

  (line-number-mode)
  (column-number-mode)
  (display-time-mode -1)
  (size-indication-mode -1)

  (use-package doom-modeline
    :init (doom-modeline-mode)
    :config
    (setq doom-modeline-buffer-file-name-style 'file-name
          doom-modeline-height 30
          doom-modeline-enable-word-count t
          doom-modeline-buffer-encoding nil
          doom-modeline-icon t
          doom-modeline-modal-icon nil
          doom-modeline-major-mode-icon t
          doom-modeline-major-mode-color-icon t
          doom-modeline-bar-width 3))

  (custom-set-faces
   '(mode-line ((t (:family "Iosevka" :height 120)))))

  (use-package hide-mode-line
    :hook
    (special-mode . hide-mode-line-mode)
    (term-mode . hide-mode-line-mode)
    (neotree-mode . hide-mode-line-mode))
#+END_SRC

** Undo Tree
We want to visualize the undo history better, so we install the undo-tree package. Oh and we don't want to save the history.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package undo-tree
    :config
    (global-undo-tree-mode)
    (setq undo-tree-auto-save-history nil))
#+END_SRC

** Formatter
Let's install a formatter to format our horrible code.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package format-all
    :init (format-all-mode))
#+END_SRC

** LSP
I use Emacs for coding as well, so we're going to configure lsp-mode.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package lsp-mode
    :init
    :hook (prog-mode . lsp-mode)
           ; (lua-mode . lsp)
           ; (python-mode . lsp)
           ; (sh-mode . lsp)
           ; (lisp-mode . lsp)
           ; (css-mode . lsp)
           ; (html-mode . lsp)
           ; (json-mode . lsp)
           ; (markdown-mode . lsp)
           ; (latex-mode . lsp)
           ; (go-mode . lsp)
           ; (text-mode . lsp)
           ; (org-mode . lsp-mode))
    :commands lsp
    :config
    (setq lsp-enable-symbol-highlighting nil
        lsp-enable-which-key-integration t
        lsp-ui-doc-enable t
        lsp-lens-enable nil
        lsp-headerline-breadcrumb-enable nil
        lsp-ui-sideline-enable nil
        lsp-ui-sideline-enable t
        lsp-modeline-code-actions-enable t
        lsp-ui-sideline-enable t
        lsp-ui-doc-border nil
        lsp-eldoc-enable-hover t
        lsp-log-io nil
        lsp-enable-file-watchers nil))

  ; (use-package lsp-grammarly)

  (use-package lsp-ui :commands lsp-ui-mode)

  (use-package lsp-treemacs
    :after lsp)

  (setq lsp-enable-symbol-highlighting nil)
#+END_SRC

** Company
Company is used for completions.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
                ("<tab>" . company-complete-selection))
          (:map lsp-mode-map
                ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))
#+END_SRC

** Flycheck
Syntax checking for code.

#+BEGIN_SRC emacs-lisp :tangle init.el
  ; (use-package flycheck
  ;   :ensure t
  ;   :init (global-flycheck-mode))
#+END_SRC

** Projectile
Here, we install and configure projectile, which is a project interaction library.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package projectile
    :config (projectile-mode 1))
#+END_SRC

* Org Mode
** Org Download
Drag-and-drop images directly into Emacs!

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package org-download)
#+END_SRC

** Org Indent
Indent the contents of an Org document.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'org-mode-hook 'org-indent-mode)
#+END_SRC

** Pretty Entities
Renders a handful of LaTeX expressions.

#+BEGIN_SRC emacs-lisp :tangle init.el
  ; (add-hook 'org-mode-hook 'org-toggle-pretty-entities)
#+END_SRC

** Org Bullets
Customize the face of the bullets.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package org-bullets
    :ensure t
    :init
    (setq org-bullets-bullet-list
          '("•"))
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+END_SRC

** Org Ellipses
Change the character for the ellipses.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq org-ellipsis " ⤵ ")
#+END_SRC

** Org TOC
We like table of contents, right?

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package toc-org)
#+END_SRC

** SVG Tag Mode

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package svg-tag-mode
    :init
    (defconst date-re "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}")
    (defconst time-re "[0-9]\\{2\\}:[0-9]\\{2\\}")
    (defconst day-re "[A-Za-z]\\{3\\}")

    (defun svg-progress-percent (value)
      (svg-image (svg-lib-concat
                  (svg-lib-progress-bar (/ (string-to-number value) 100.0)
                                    nil :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
                  (svg-lib-tag (concat value "%")
                               nil :stroke 0 :margin 0)) :ascent 'center))

    (defun svg-progress-count (value)
      (let* ((seq (mapcar #'string-to-number (split-string value "/")))
             (count (float (car seq)))
             (total (float (cadr seq))))
      (svg-image (svg-lib-concat
                  (svg-lib-progress-bar (/ count total) nil
                                        :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
                  (svg-lib-tag value nil
                               :stroke 0 :margin 0)) :ascent 'center)))

    (setq svg-tag-tags
      `(
        ;; Org tags

        (":\\([A-Za-z0-9]+\\)" . ((lambda (tag) (svg-tag-make tag))))
        (":\\([A-Za-z0-9]+[ \-]\\)" . ((lambda (tag) tag)))

        ;; Task priority

        ("\\[#[A-Z]\\]" . ( (lambda (tag)
                              (svg-tag-make tag :face 'org-priority 
                                            :beg 2 :end -1 :margin 0))))

        ;; Progress

        ("\\(\\[[0-9]\\{1,3\\}%\\]\\)" . ((lambda (tag)
                                            (svg-progress-percent (substring tag 1 -2)))))
        ("\\(\\[[0-9]+/[0-9]+\\]\\)" . ((lambda (tag)
                                          (svg-progress-count (substring tag 1 -1)))))

        ;; TODO / DONE
        ("TODO" . ((lambda (tag) (svg-tag-make "TODO" :face 'org-todo :inverse t :margin 0))))
        ("DONE" . ((lambda (tag) (svg-tag-make "DONE" :face 'org-done :margin 0))))
        ("IN PROGRESS" . ((lambda (tag) (svg-tag-make "IN PROGRESS" :face 'org-done :margin 0))))
        ("CANCELLED" . ((lambda (tag) (svg-tag-make "CANCELLED" :face 'org-done :margin 0))))

        ;; Citation of the form [cite:@Knuth:1984] 

        ("\\(\\[cite:@[A-Za-z]+:\\)" . ((lambda (tag)
                                          (svg-tag-make tag
                                                        :inverse t
                                                        :beg 7 :end -1
                                                        :crop-right t))))
        ("\\[cite:@[A-Za-z]+:\\([0-9]+\\]\\)" . ((lambda (tag)
                                                (svg-tag-make tag
                                                              :end -1
                                                              :crop-left t))))

        ;; Active date (without day name, with or without time)

        (,(format "\\(<%s>\\)" date-re) .
         ((lambda (tag)
            (svg-tag-make tag :beg 1 :end -1 :margin 0))))
        (,(format "\\(<%s *\\)%s>" date-re time-re) .
         ((lambda (tag)
            (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0))))
        (,(format "<%s *\\(%s>\\)" date-re time-re) .
         ((lambda (tag)
            (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0))))

        ;; Inactive date (without day name, with or without time)

         (,(format "\\(\\[%s\\]\\)" date-re) .
          ((lambda (tag)
             (svg-tag-make tag :beg 1 :end -1 :margin 0 :face 'org-date))))
         (,(format "\\(\\[%s *\\)%s\\]" date-re time-re) .
          ((lambda (tag)
             (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0 :face 'org-date))))
         (,(format "\\[%s *\\(%s\\]\\)" date-re time-re) .
          ((lambda (tag)
             (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0 :face 'org-date))))))
    :hook org-mode)
#+END_SRC

** Keywords
Let's add our own custom keywords and highlight them.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq org-todo-keywords
       '((sequence "TODO" "IN PROGRESS" "CANCELLED" "DONE")))
#+END_SRC

* Functions
** Compilation
A keybind for compilation.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (global-set-key (kbd "S-<f9>") 'compile)
  (global-set-key (kbd "<f9>") 'recompile)
#+END_SRC

